# # სიის შექმნა
# my_list = ["ვაშლი", "ბანანი", "ფორთოხალი", "ატამი", "მსხალი"]

# # სიის თითოეული ელემენტის დაბეჭდვა ინდექსების გამოყენებით

# print(my_list[0])
# print(my_list[1])
# print(my_list[2])
# print(my_list[3])
# print(my_list[4])

# user_input=int(input("Enter num"))
# num_list=[2,3,5,6,7,1,9,12,13,14]

# print(user_input)

# # მომხმარებლისგან რიცხვის შემოტანა და მისი მთელი რიცხვის სახით შენახვა
# user_input = int(input("შეიყვანეთ რიცხვი (0-დან 9-მდე): "))

# # სიის შექმნა 10 ელემენტით
# my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# # მომხმარებლის მიერ შემოტანილი რიცხვის ინდექსზე მყოფი ელემენტის დაბეჭდვა
# print(f"სიაში {user_input} ინდექსზე მყოფი ელემენტი არის: {my_list[user_input]}")

# მომხმარებლისგან რიცხვის შემოტანა და მისი მთელი რიცხვის სახით შენახვა
user_input = int(input("შეიყვანეთ რიცხვი (0-დან 9-მდე): "))

# სიის შექმნა 10 ელემენტით
my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# მომხმარებლის მიერ შემოტანილი რიცხვის ინდექსზე მყოფი ელემენტის დაბეჭდვა
print(user_input)
