# 1) ჩამოწერეთ 10 მაგალითი თითოეულ ოპერაციაზე: +=, -=, *=, /=

# # += ოპერაცია
# x += 1  # x = x + 1
# y += 2  # y = y + 2
# z += 3  # z = z + 3
# u += 4  # u = u + 4
# v += 5  # v = v + 5
# w += 6  # w = w + 6
# p += 7  # p = p + 7
# q += 8  # q = q + 8
# r += 9  # r = r + 9
# s += 10 # s = s + 10

# # -= ოპერაცია
# a -= 1  # a = a - 1
# b -= 2  # b = b - 2
# c -= 3  # c = c - 3
# d -= 4  # d = d - 4
# e -= 5  # e = e - 5
# f -= 6  # f = f - 6
# g -= 7  # g = g - 7
# h -= 8  # h = h - 8
# i -= 9  # i = i - 9
# j -= 10 # j = j - 10

# # *= ოპერაცია
# m *= 1  # m = m * 1
# n *= 2  # n = n * 2
# o *= 3  # o = o * 3
# p *= 4  # p = p * 4
# q *= 5  # q = q * 5
# r *= 6  # r = r * 6
# s *= 7  # s = s * 7
# t *= 8  # t = t * 8
# u *= 9  # u = u * 9
# v *= 10 # v = v * 10

# # /= ოპერაცია
# k /= 1  # k = k / 1
# l /= 2  # l = l / 2
# m /= 3  # m = m / 3
# n /= 4  # n = n / 4
# o /= 5  # o = o / 5
# p /= 6  # p = p / 6
# q /= 7  # q = q / 7
# r /= 8  # r = r / 8
# s /= 9  # s = s / 9
# t /= 10 # t = t / 10

# 2) თქვენი სიტყვებით ახსენით როგორ მუშაობს მეტია ან ტოლია (>=), ნაკლებია ან ტოლია (<=)
# >= ეს იმას ნიშნავს რომ მაგალითად გვაქვს 8>=2 აქ bool იქნება True იმიტომ რომ 8 ორის ტოლი არ არის მაგრამ რვა 2-ზემეტი და ამით ეს გამოდის True <= ეს კი მაგ. 8<=2 ეს False იმიტომ რომ რვა ორის ტოლიც არ არის და 2 რვაზე მეტი არ არის

# 3) თქვენი სიტყვებით ახსენით როგორ მუშაობს პირობითი განცხადებები. გააკეთეთ მარტივი flowchart (ბლოკ-სქემა) რამე მაგალითზ

# პირობითი განცხადებები (if statements) პროგრამირების ენებში გამოიყენება, რათა პროგრამამ შეასრულოს სხვადასხვა მოქმედებები სხვადასხვა პირობების მიხედვით. ეს არის ერთ-ერთი ძირითადი მექანიზმი, რომელიც პროგრამას საშუალებას აძლევს მიიღოს გადაწყვეტილებები.
# როგორ მუშაობს პირობითი განცხადებები:
# პირობის შემოწმება: პროგრამა ამოწმებს მოცემულ პირობას (მაგალითად, if x > 10).
# თუ პირობა მართალია: თუ პირობა მართალია, პროგრამა ასრულებს შესაბამის კოდს.
# # თუ პირობა მცდარია: თუ პირობა მცდარია, პროგრამა გადადის შემდეგი პირობის შემოწმებაზე ან ასრულებს სხვა კოდს (მაგალითად, else).

# მაგალითი:
x = 15

if x > 10:
    print("x is greater than 10")
else:
    print("x is not greater than 10")

# 5) მომხმარებელს შემოატანინე რიცხვი და შეინახე მთელი რიცხვის სახით.
# თუ ეს რიცხვი მეტია 100-ზე, დაბეჭდე "big number",
# სხვა შემთხვევაში დაბეჭდე "small number"

user_num=int(input("enter your number"))
if user_num>100:
    print("big number")
else:
    print("small number")
