# 1) თქვენი სიტყვებით ახსენით რა არის ბულეანი და ბინარული კოდი
# 2) შემდეგ 4 ოპერატორზე: >, <, ==, != ჩამოწერეთ 10-10 მაგალითი. ჯამში გამოგივათ 40 მაგალითი
# 3) თქვენი სიტყვებით ახსენით როგორ მუშაობს შემდეგი 4 ოპერატორი: >, <, ==, !=
# 4) მომხმარებელს შემოატანინეთ რიცხვი და შეინახეთ მთელი რიცხვის სახით. მომხმარებელს შემოატანინეთ რიცხვი და მეორე ცვლადში შეინახეთ მთელი რიცხვის სახით.
# შემდეგ დაბეჭდეთ:
# პირველი რიცხვი > მეორე რიცხვი
# პირველი რიცხვი < მეორე რიცხვი
# პირველი რიცხვი == მეორე რიცხვი
# პირველი რიცხვი != მეორე რიცხვი
# 1)
# ბულანი აცვენბს დაწერილი მაგალითი სწორია თუ არასწორიი მას აქ მხოლოთ ორი output False და true
# ბინარული კოდი არის კოდი დაწერილი 0 და 1 ანით 0 
# 2)
print(5>5)
print(85>58)
print(874>89)
print(741>85258)
print(8447>8748)             #მეტობები
print(78954>98588)
print(858>789)
print(845>785)
print(796>85)
print(858>855)



print(78<88)
print(858<585)
print(854<658)
print(888<555)
print(8844<855)
print(54<85)                    #ნაკლებობები
print(789<547)
print(8844<55)
print(4555<5555)
print(877<4444)


print(55==85)
print(589==589)
print(852==852)
print(789==896)
print(85258==85258)              #ტოლია
print(147==852)
print(852147==8512147)
print(963258741==369852147)
print(123654789==123654789)
print(785==858)


print(33!=12)
print(55!=741)
print(852!=852)
print(96369!=8526)
print(741!=741)
print(7!=7)                        #არ არის ტოლი
print(85!=748)
print(88!=88)
print(74147!=74158)
print(748554!=855547)

# 3)

# >-არის მეტობის ნიშანი და მაგალითად ჩვენ დავწერეთ 5>2 ტერმინალი გამოიტანს True-ს და თუ დავწერეთ 5>8 ტერმინალი გამოიტანს False-ს.
# <-ეს არის ნაკლებობის ნიშანი იგივეა რაც მეტობის ნიშანი მაგ. 8<9 გამოინტანს True-ს და დავწერთ 8<5 გამოიტანს False-ს.
# ==-იგივეა რაც უდრის მაგრამ პითონში იწერება ასე == .
# !=-ეს არის არ უდრის მაგ. 5!=8 გამოიტანს True-ს და თუ დავწერთ 5!=5 გამოიტანს False-ს.

# 4)

# num1=int(input("enter your number"))
# num2=int(input("enter your number "))

# print(num1>num2)
# print(num1<num2)
# print(num1==num2)
# print(num1!=num2)

num3 = input("Enter")
print(num3 *1000000 )
